garkushin/src/Documents/СдачаВАренду/СдачаВАренду.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СдачаВАренду</name>
  <registerRecords>AccumulationRegister.ОстаткиСамокатов</registerRecords>
  <registerRecords>AccumulationRegister.АрендаСамокатов</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
</mdclass:Document>

garkushin/src/AccumulationRegisters/ОстаткиСамокатов/ОстаткиСамокатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиСамокатов</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

garkushin/src/AccumulationRegisters/АрендаСамокатов/АрендаСамокатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>АрендаСамокатов</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

garkushin/src/Documents/СдачаВАренду/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиСамокатов Расход
	Движения.ОстаткиСамокатов.Записывать = Истина;
	Движение = Движения.ОстаткиСамокатов.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Количество = 1;

	// регистр АрендаСамокатов Приход
	Движения.АрендаСамокатов.Записывать = Истина;
	Движение = Движения.АрендаСамокатов.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Студент = Студент;
	Движение.Количество = 1;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
